---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.EmbeddedButShouldNotBe
source: html/d13b7c70-f2de-ccdc-643c-86ef65dc8d2f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.EmbeddedButShouldNotBe Property

Conditions for wall embedding are no longer satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId EmbeddedButShouldNotBe { get; }
```